{
  "about": "\n# Francisco Manuel Olmedo Cortés\n## AI Solutions Architect & Physicist\n\n> \"I build intelligent systems that solve real business problems.\"\n\nHola, soy Fran. Soy físico de formación, pero mi curiosidad me llevó a la arquitectura de soluciones de IA.\nCofundador de **BlakIA**, donde diseño pipelines de IA que reducen costes y aumentan la eficiencia.\n\n### 🧠 The Geek Side\nNo soy el típico consultor. Vengo de la física (óptica y medios desordenados), lo que me da una perspectiva única para la simulación y optimización.\n\n*   **Teclados:** Construyo y utilizo teclados mecánicos custom ultra-compactos (ej., Fifi Keyboard) con layouts minimalistas de 34 teclas.\n*   **WPM:** Mi velocidad de escritura promedio es de 97 WPM en Monkeytype.\n*   **Hobby:** Ex-atleta de calistenia, disfruto del anime y los videojuegos.\n*   **OS:** Un gran amante de Linux y Neovim.\n\n### 📍 Ubicación\nCórdoba, Andalucía, España\n  ",
  "experience": "\n# Experiencia Profesional\n\n## 🚀 BlakIA\n### Cofounder & AI Solutions Architect\n*Córdoba, Andalucía, España*\n*Julio 2024 – Presente*\n- Diseño y despliegue de pipelines de IA personalizados para PYMES, integrando LLMs, sistemas RAG y herramientas de automatización como n8n y LangChain.\n- Desarrollo de infraestructura que gestionó +100K mensajes durante eventos urbanos, facilitando la comunicación en tiempo real vía WhatsApp y bots web.\n- Implementación de arquitectura SaaS multi-tenant escalable con monitorización, métricas y dashboards de autoservicio para clientes.\n\n## 💻 Freelance AI & ML Developer\n*Julio 2024 – Presente*\n- Construcción de sistemas de automatización end-to-end que redujeron la carga de trabajo manual en un 60% para clientes de consultoría y marketing.\n- Desarrollo de bots de cualificación de leads y herramientas internas utilizando APIs de OpenAI, estrategias de LLMOps y bases de datos vectoriales.\n\n## 🔬 Universidad de Córdoba\n### Researcher & Teaching Assistant\n*Córdoba, Andalucía, España*\n*Septiembre 2024 – Enero 2025 (Researcher)*\n- Lideré el desarrollo de software de simulación para materiales ópticos desordenados, utilizando trazado de rayos y algoritmos genéticos.\n*Octubre 2022 – Junio 2023 (Teaching Assistant)*\n- Impartí cursos introductorios de Python y ciencia de datos, con énfasis en aplicaciones para la investigación científica.\n\n## ⚡ IDENER.AI\n### Researcher\n*Sevilla, Andalucía, España*\n*Abril 2024 – Julio 2024*\n- Apliqué modelos de redes neuronales para la previsión de series temporales, mejorando las predicciones de producción de energía.\n\n## ⚛️ CIEMAT\n### Intern\n*Madrid, España*\n*Julio 2022 – Septiembre 2022*\n- Desarrollé modelos de simulación para materiales termoluminiscentes, aumentando la precisión en la predicción de rendimiento.\n  ",
  "skills": "\n# Stack Tecnológico\n\n## 🧠 AI & Intelligent Systems\n- Arquitectura de Sistemas de IA\n- LLMs, LangChain, RAG\n- OpenAI API\n- Automatización de Workflows con n8n\n- Modelado Computacional\n- Data-Driven Solutions\n\n## 🛠️ Infrastructure & Backend\n- Python, FastAPI\n- Git, Docker, CI/CD\n- Bases de Datos Vectoriales (Qdrant, Weaviate)\n- Hetzner, GCP\n\n## 🎨 Frontend & Design\n- React, Astro, Tailwind CSS\n- Vim (Si, es una habilidad y una filosofía)\n- Diseño minimalista, experiencia de usuario centrada en la terminal.\n\n## 🗣️ Idiomas\n- Español: Nativo\n- Inglés: B2 (Anglia)\n  ",
  "contact": "\n# Contacto & Redes\n\nSi quieres charlar sobre arquitectura de IA, la física del universo, teclados mecánicos o el último anime de temporada, no dudes en contactarme:\n\n- **Email:** fran@blakia.es\n- **Web:** www.blakia.es\n- **GitHub:** [FullFran](https://github.com/FullFran)\n- **LinkedIn:** [Francisco Olmedo Cortés](https://www.linkedin.com/in/francisco-olmedo-cortes/)\n\n---\n*Developed with 💖 using Astro, React & Tailwind CSS. Inspired by the command line.\n  ",
  "blog": [
    {
      "id": "welcome",
      "title": "welcome.md",
      "date": "2025-11-26",
      "content": "# Welcome to my Terminal\n      \nEste es el primer log digital de mi \"personal OS\". Aquí compartiré pensamientos sobre arquitectura de IA, el fascinante mundo de los teclados mecánicos, mis incursiones en simulaciones físicas y quizá alguna review de anime o videojuego retro.\n\nPara navegar, puedes usar el explorador de archivos (si eres de ratón) o, si te sientes más \"geek\", los comandos de Vim."
    }
  ],
  "help": "\n# Vim Commands Help\n\n## 🚶 Movement (Normal & Visual Modes)\n\n*   `h` `ArrowLeft`: Move cursor left\n*   `l` `ArrowRight`: Move cursor right\n*   `j` `ArrowDown`: Move cursor down\n*   `k` `ArrowUp`: Move cursor up\n*   `w`: Move to the beginning of the next word\n*   `b`: Move to the beginning of the previous word\n*   `gg`: Go to the first line of the document\n*   `G`: Go to the last line of the document\n\n## 🔢 Multipliers\n\nPrefix any movement command with a number to repeat it.\n*   Example: `3j` moves down 3 lines.\n*   Example: `2w` moves forward 2 words.\n\n## 💻 Modes\n\n*   `i`: Enter INSERT mode (Admin only).\n*   `v`: Enter VISUAL mode (select text). Press `v` again or `Escape` to exit.\n*   `Escape`: Exit current mode and return to NORMAL mode.\n\n## ⌨️ Command Line (Type `:` in NORMAL mode)\n\n*   `:help`: Show this help message.\n*   `:login`: Access the admin login screen.\n*   `:w` or `:write`: Save changes (Admin only).\n*   `:q` or `:quit`: Close current blog post or log out of admin.\n*   `:touch <filename>`: Create a new blog post (Admin only, in Blog tab).\n\n## 🗂️ Tab Switching\n\n*   `Ctrl + h` or `Ctrl + ArrowLeft`: Cycle to the previous tab.\n*   `Ctrl + l` or `Ctrl + ArrowRight`: Cycle to the next tab.\n"
}
